{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FShaderOptimizationToolModule",
			"Children": [
				{
					"Source":
					{
						"Text": "关闭当前材质编译的队列"
					},
					"Translation":
					{
						"Text": "Close the current material compilation queue"
					},
					"Key": "CancelAllCompilations"
				},
				{
					"Source":
					{
						"Text": "可以选择或者将整个场景的材质重新编译"
					},
					"Translation":
					{
						"Text": "Material can be selected or recompiled for the entire scene"
					},
					"Key": "ReCompilations"
				},
				{
					"Source":
					{
						"Text": "开启将场景变为灰模效果，关闭则恢复默认显示效果，选择的物体不会变成灰模效果"
					},
					"Translation":
					{
						"Text": "Turn on to turn the scene into a grayscale effect, turn it off to restore the default display effect, and the selected object will not become a grayscale effect"
					},
					"Key": "ClearCache"
				},
				{
					"Source":
					{
						"Text": "注意，开启跳过材质编译功能后不要打开材质编辑器，已经打开也不要编译。"
					},
					"Translation":
					{
						"Text": "Note, do not open the material editor after enabling the skip material compilation function, and do not compile it if it is already open."
					},
					"Key": "SkipShaderCompilation"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FShaderOptimizationToolModule",
					"Children": [
						{
							"Source":
							{
								"Text": "CancelAllCompilations"
							},
							"Translation":
							{
								"Text": "CancelAllCompilations"
							},
							"Key": "PluginAction_CancelAllCompilations"
						},
						{
							"Source":
							{
								"Text": "ClearCache"
							},
							"Translation":
							{
								"Text": "ClearCache"
							},
							"Key": "PluginAction_ClearCache"
						},
						{
							"Source":
							{
								"Text": "Execute CancelAllCompilations action"
							},
							"Translation":
							{
								"Text": "Execute CancelAllCompilations action"
							},
							"Key": "PluginAction_CancelAllCompilations_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Execute ClearCache action"
							},
							"Translation":
							{
								"Text": "Execute ClearCache action"
							},
							"Key": "PluginAction_ClearCache_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Execute ReCompilations action"
							},
							"Translation":
							{
								"Text": "Execute ReCompilations action"
							},
							"Key": "PluginAction_ReCompilations_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Execute SkipShaderCompilation action"
							},
							"Translation":
							{
								"Text": "Execute SkipShaderCompilation action"
							},
							"Key": "PluginAction_SkipShaderCompilation_ToolTip"
						},
						{
							"Source":
							{
								"Text": "ReCompilations"
							},
							"Translation":
							{
								"Text": "ReCompilations"
							},
							"Key": "PluginAction_ReCompilations"
						},
						{
							"Source":
							{
								"Text": "SkipShaderCompilation"
							},
							"Translation":
							{
								"Text": "SkipShaderCompilation"
							},
							"Key": "PluginAction_SkipShaderCompilation"
						}
					]
				}
			]
		}
	]
}